const calendar = require("../calendar");

class Festival {
    constructor() {
        this.lunarFestival = {
            "12-8": "腊八节",
            "12-30": "除夕",
            "1-1": "春节",
            "1-15": "元宵节(上元节)",
            "2-2": "龙抬头",
            "3-7": "寒食节",
            "5-5": "端午节",
            "7-7": "七夕",
            "7-15": "中元节",
            "8-15": "中秋节",
            "9-9": "重阳节"
        };

        this.solarFestival = {
            "1-1": "元旦",
            "1-31": "国际麻风节",
            "1-26": "国际海关日",
            "2-2": "世界湿地日",
            "2-7": "国际声援南非日",
            "2-10": "国际气象节",
            "2-14": "情人节",
            "2-24": "第三世界青年日",
            "2-4": "世界抗癌症日",
            "2-21": "国际母语日",
            "2-29": "国际罕见病日",
            "3-1": "国际海豹日",
            "3-3": "全国爱耳日",
            "3-5": "学雷锋纪念日",
            "3-8": "三八妇女节",
            "3-12": "植树节",
            "3-14": "白色情人节",
            "3-15": "消费者权益日",
            "3-17": "国际航海日",
            "3-20": "世界无肉日",
            "3-22": "世界水日",
            "3-23": "世界气象日",
            "3-11": "国际尊严尊敬日",
            "3-16": "手拉手情系贫困小伙伴全国统一行动日",
            "3-21": "世界森林日",
            "3-24": "世界防治结核病日",
            "3-25": "耶稣受难日",
            "4-1": "愚人节",
            "4-2": "国际儿童图书日",
            "4-7": "世界卫生日",
            "4-11": "世界帕金森病日",
            "4-22": "世界地球日",
            "4-23": "世界读书日",
            "4-26": "世界知识产权日",
            "4-16": "复活节",
            "5-1": "五一国际劳动节",
            "5-4": "中国青年节",
            "5-3": "世界哮喘日",
            "5-8": "世界红十字日",
            "5-12": "国际护士节",
            "5-14": "母亲节",
            "05-15": "防治碘缺乏病日",
            "5-17": "世界电信日",
            "5-18": "国际博物馆日",
            "5-22": "国际生物多样性日",
            "5-31": "世界无烟日",
            "6-6": "全国爱眼日",
            "6-1": "国际儿童节",
            "6-5": "世界环境日",
            "6-11": "中国文化遗产日",
            "6-18": "父亲节",
            "6-17": "世界防治荒漠化和干旱日",
            "6-20": "世界难民日",
            "6-23": "国际奥林匹克日",
            "6-25": "全国土地日",
            "6-26": "国际禁毒日",
            "7-1": "建党节",
            "8-1": "建军节",
            "9-3": "中国人民抗日战争纪念日",
            "7-11": "世界人口日",
            "9-8": "国际扫盲日",
            "9-10": "教师节",
            "9-16": "国际臭氧层保护日",
            "9-18": "中国国耻日",
            "9-20": "国际爱牙日",
            "9-21": "国际和平日",
            "9-27": "世界旅游日",
            "10-1": "国际音乐日",
            "10-4": "世界动物日",
            "10-8": "全国高血压日",
            "10-9": "世界邮政日",
            "10-10": "世界精神卫生日",
            "10-15": "国际盲人节",
            "10-16": "世界粮食节",
            "10-17": "国际消除贫困日",
            "10-22": "世界传统医药日",
            "10-24": "联合国日",
            "10-25": "人类天花绝迹日",
            "11-1": "万圣节",
            "11-8": "中国记者日",
            "11-9": "消防宣传日",
            "11-11": "光棍节",
            "11-14": "联合国糖尿病日",
            "11-17": "国际大学生节",
            "12-1": "世界艾滋病日",
            "12-3": "国际残疾人日",
            "12-9": "世界足球日",
            "12-13": "南京大屠杀纪念日",
            "12-15": "世界强化免疫日",
            "12-20": "澳门回归日",
            "12-21": "国际篮球日",
            "12-24": "平安夜",
            "12-25": "圣诞节",
            "12-26": "毛泽东诞辰日"
        }
    }

    getFestival(year, month, day) {
        if (!year || !month || !day) {
            let now = new Date();
            year = now.getFullYear();
            month = now.getMonth() + 1;
            day = now.getDate();
        }

        let lunar = calendar.solar2lunar(year, month, day);
        lunar.lunarFestival = this.lunarFestival[`${lunar.lMonth}-${lunar.lDay}`]
        lunar.solarFestival = this.solarFestival[`${lunar.cMonth}-${lunar.cDay}`]
        return lunar;
    }
}

module.exports = new Festival();